"""
    逻辑结构:
        特点:
            1 只是描述数据结构中数据元素之间的练习规律
            2 是从具体问题中抽象出数学模型（与计算机无关）

        逻辑结构的分类:
            线性结构:
                总的来说线性结构就是n个数据元素的集合，具有以下特点:
                    1 集合中第一个元素只有一个
                    2 集合中最后一个元素只有一个
                    3 出最后元素之外，其它数据元素只有一个"后继"
                    4 除第一个元素外，其它数据元素只有一个"前继"

            树形结构(层次结构):
                线性结构是一条线，一对一
                树形结构就是会分叉的，一对多(例如文件夹)

            图状结构(网状结构):
                多对多，任意两个元素之间都可能有关系(例如高铁线路)

            其它结构:
                
"""