"""
    前情回顾:
        1 http响应:
            响应行，响应头，空行，响应体

            httpserver: 接收请求，反馈响应

        2 struct模块
            功能: 将一组数据打包为字节串
                 对接收到的数据进行解析

            Struct() 生成格式对象
            pack() 打包数据
            unpack() 解析数据

        3 基本概念
            多任务编程:
                一个程序中写多个任务，多个任务同时进行
            并发:

            并行:

            进程:
                程序执行的过程
                    进程的状态描述:
                    进程的状态转换:

        4 fork创建进程:

        5 gitpid()  gitppid()
          _exit()  exit()

        6 孤儿进程和僵尸进程:
            解决僵尸进程的方法:
                wait()
                二级子进程
                signal
"""

