# 1.1 什么是程序？
"""程序就是软件，它控制着计算机的一切，并且所有软件都是程序员和开发人员创建的"""
# 1.2 什么是硬件？
"""是指计算机的物理元件，是构成计算机的物理设备"""
# 1.3 列出计算机系统的五个主要部件？
"""中央处理器(cpu), 内存， 辅助存储设备(硬盘，CD等)， 输入设备， 输出设备"""
# 1.4 计算机实际运行程序的是哪个部件？
"""cpu"""
# 1.5 计算机运行时，哪个部件可用来存储程序及其数据？
"""内存"""
# 1.6 即使计算机没有电，哪个部件也能长时间的保存数据？
"""辅助存储设备"""
# 1.7 计算机的哪个部件从人和其他设备收集数据？
"""输入设备"""
# 1.8 计算机的哪个部件为人或其他设备格式化并显示数据？
"""输出设备"""
# 1.9 什么基本程序控制计算机硬件的内部运行？
"""操作系统"""
# 1.10 执行专门任务的程序(如病毒扫描程序，文件压缩程序或数据备份程序)称为什么软件？
"""系统软件"""
# 1.11 文字处理程序，电子表格程序，网页浏览器和游戏属于哪一类软件？
"""应用程序软件"""


# 1.12 多少内存足以存储ASCII字母表或小数字?
"""ASCII码一共128个，存储一个ASCII码需要一个字节(1b),所以需要128个字节"""
# 1.13 一个微小的可以设置为开或关的 “开关”，称为什么?
"""被称为位(bit)，一个字节有八位，也就是八bit"""
# 1.14 在什么编码系统中，所有的数值都写成0和1的字列?
"""二进制编码系统"""
# 1.15 ASCII 的用途是什么?
"""显示西方的英文字母，标点符号，以及数字0-9"""
# 1.16 什么编码方案足以代表世界上许多语言的特征?
"""Unicode"""
# 1.17 “数字化数据”和“数字设备”各是什么意思?
"""数字化数据是以二进制形式存储的数据，数字设备是可以与二进制数据一起工作的任何设备(例如计算机)"""


# 1.18 CPU 只能理解用什么语言编写的指令?
"""机器语言"""
# 1.19 程序在每次被 CPU执行时必须被复制到什么类型的存储器中?
"""内存"""
# 1.20 CPU 执行程序指令的过程是什么?
"""读取，解析，执行"""
# 1.21什么是汇编语言?
"""用于替代机器语言的一种低级语言(需要掌握cpu的工作原理)"""
# 1.22什么类型的编 程语言允许在不知道CPU如何工作的情况下编写功能强大且复杂的程序?
"""高级语言，例如python"""
# 1.23每种语言都有 一套在编写程序时必须严格遵守的规则，这套规则叫什么?
"""语法"""
# 1.24将高级语言 程序翻译为独立的机器语言程序的程序叫什么?
"""编译器(形成独立的机器语言程序，随时执行)"""
# 1.25翻译并执行高级语 言程序中的指令的程序叫什么?
"""解释器(翻译高级语言为机器语言，并立即执行)"""
# 1.26关键字拼写错误、 缺少标点符号或错误使用操作符造成的是什么类型的错误?
"""语法错误"""
