"""
        HTML语法介绍:
            1 HTML介绍:
                超文本标记语言(浏览器能够识别的语言，通过标签的形式构建页面结构和填充内容)

            2 标签:
                标签也称为标记或元素，用于在网页中标记内容

                1 语法:
                    标签使用< >为标志，标签名不区分大小写，推荐用小写

                2 分类:
                    1 双标签(成对出现，包含开始标签和结束标签)
                    2 单标签(只用开始标签，没有结束标签，可以手动添加"/"表示闭合)

            3 html结构:
                1个HTML根元素:
                    1个head元素(head元素中的内容是对页面的描述，一般不会直接显示在页面中，会对页面有影响):
                        n个meta元素
                        n个title元素
                    1个body元素(被页面显示的元素都在body元素中):
                        n个div元素
                        n个p元素
            4 快捷键:
                ! + tab,自动补全基础结构

            5 标签属性:
                标签属性用空格与标签名隔开，在开始标签中使用，属性值用双引号表示(单引号也可以)

            6 标签嵌套:
                在双标签中书写其他标签，称为嵌套标签
                嵌套结构中，外层元素称为父元素，内层元素称为子元素
                多层嵌套结构中，所有外层元素统称为祖先元素，内层元素统称为后代元素
                平级结构互为兄弟元素

            7 HTML语法规范:
                标签名不区分大小写，推荐小写
                注释(快捷键，ctrl加/):
                    <!-- 这是注释内容 -->




"""