"""
    第二阶段内容回顾:
        1 数据结构:
            逻辑模型, 存储模型的设计
            常见的数据结构模型 (线性顺序表(列表), 线性链式表(链表), 顺序栈, 链式栈，顺序队列, 链式队列，二叉树)
            排序查找，(递归，冒泡，选择，插入，快速，二分查找)

        2 IO 网络编程:
            * 文件操作:
                文件的打开和读写操作,(字节串)

            × 网络编程:
                网络基础
                tcp
                udp
                http 协议
                struct 模块

            * IO 模型:
                阻塞io:
                非阻塞io:
                io多路复用:
                    select poll epoll

            * 协程:
                异步io，gevent

        3 进程线程:
            进程:
                进程理论， fork， multiprocessing， 进程间通信， 进程池
            线程:
                threading， 自定义线程类， 同步互斥

        4 正则表达式:

        5 mysql 数据库:
            数据库的创建，数据表的创建， 数据的增删改查， 数据类型， pymysql，

        6 git的使用:

        7 代码总结:
            聊天室， ftp文件服务器， 电子词典， HTTPServer2.0， HTTPServer3.0




"""