"""
    linux命令:
        ctrl shift + (放大)
        ctrl - (缩小)
        ls (查看当前目录的文件)
        ls -l 文件名 (显示跟详细的信息)
        ls -a (显示隐藏文件) （linux下以点开头的文件是隐藏文件）
        ctrl alt t (打开新的终端,在根目录下)
        ctrl shift n (打开新的终端, 在当前目录下)

        cd .. (返回上级目录)
        ctrl l (清屏)
        mkdir 文件夹 (创建文件夹)
        rm 文件名.格式 (删除文件，如果是文件夹要在加一个 -r)
        cat 文件名 (在终端上打开文件)
        touch (创建文件)
        mv (移动文件)
        cp -r (复制文件)
        tab 补全

        波浪线表示主目录(主目录操作系统为用户创建的目录，一般在根目录下的home中)
        根目录文件夹:
            bin 一般存放二进制文件
            dev 一般存放驱动程序
            etc 配置文件
            lib 各种库
"""