"""
    数据库:
        数据库就是按照数据结构，存储管理数据的一块内存空间。数据库是在数据库管理系统管理和控制下，
        在一定介质上的数据集合。

    数据仓库:
        多个数据库的集合

    数据库管理系统:
        管理数据库的软件，用于建立和维护数据库

    数据库系统:
        由数据库和数据库管理系统，开发工具等组成的集合

    数据库分类和常见数据库:
        1 关系型数据库:
            关系型: 采用关系模型(二维表)来组织数据结构的数据库
            非关系型: 不采用关系模型组织数据结构的数据库

        2 开源数据库和非开源数据库:
            开源: MySQL, SQLite, MongoDB
            非开源: Oracle, DB2, SQL_Server

        3 常见的关系型数据库:
            MySQL, Oracle, SQL_Server, DB2, SQLite

    
"""