"""
    第三阶段总结项目分析(网页web):
        1 导航条:
            1 通栏到头,固定在顶部
            2 点击'登录'连接弹出居中登录对话框
            3 样式和间距按效果制作

        2 登录窗口:
            1 居中显示
            2 带圆角和阴影
            3 点击login按钮后自动验证用户名和密码是否为空
            4 如果不为空,则提交,否则,出现错误提示

        3 文章列表页面:
            1 在导航栏中点击进入
            2 有列表标题
            3 图文并茂的具体内容在左侧
            4 在右侧有一个特别推荐的图片列表

        4 我的相册页面:
            1 在导航栏中点击进入
            2 相册图片列表
            3 在图片的右上角有一个喜欢的文字和数量

    做项目注意事项:
        1 需求(要有需求文档,不能是口头的):
            1 功能
            2 文档
            3 流程
            4 时间

        2 技术分析(针对文档来分析):
            1 使用什么技术
            2 人员分工
            3 每个人完成的周期

        3 项目实际开发(针对技术和人员各自开发):
            1 每周站会(总结技术中碰到的问题)
            2 每天有十分钟的例会(知道昨天做了什么,今天要做什么)

        4 项目测试(测试人员根据需求完成测试工作):
            1 功能测试
            2 bug提交 -- 修改bug
            3 编写测试报告

        5 项目部署(源码的提交):
            1 将项目从测试服务器部署到正式服务器中
            2 测试人员在正式服务器上再次进行测试
            3 完成项目上线

        
"""