"""
    元素的尺寸和颜色:
        1 元素的尺寸:
            1 px像素
            2 百分比 % (相对父元素)
            3 相对单位 em, 1个em=16px (相对父元素),通常用于移动端的页面开发,常用1.5em
            4 rpx,小程序页面的单位
            5 当页面元素的内容超出了页面元素范围,可以使用overflow属性,来解决超出部分的显示方式,建议使用auto

        2 元素的颜色:
            颜色是指元素的字体,背景,边框等的颜色

            1 使用方式:
                1 color:red; 英文单词
                2 color:#ffffff; 长十六进制
                3 color:#fff; 短十六进制,长十六进制的缩写
                4 color:rgb(2,3,5); rgb值
                5 color:rgba(2,3,5,0.5); rgba值,在rgb基础上加了一个透明度的值

"""